# 4. Создать (не программно) текстовый файл со следующим содержимым:
# One — 1
# Two — 2
# Three — 3
# Four — 4
# Необходимо написать программу, открывающую файл на чтение и считывающую построчно данные.
# При этом английские числительные должны заменяться на русские.
# Новый блок строк должен записываться в новый текстовый файл.


rus = {'One': 'Один', 'Two': 'Два', 'Three': 'Три', 'Four': 'Четыре'}
new_file = []
with open('task_4.txt.', 'r', encoding='UTF-8') as f:
    for i in f:
        i = i.split(' ', 1)
        new_file.append(f'{rus[i[0]]} {i[1]}')


    for lines in new_file:
        print(lines, end='')

